Revit 2026 API

# FabricationServiceButtonGetConditionLowerValue Method

---

Gets the condition lower value (valid if greater or equal) for a given condition index.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double GetConditionLowerValue(
	int condition
)
```
```vb
Public Function GetConditionLowerValue (
	condition As Integer
) As Double
```
```cpp
public:
double GetConditionLowerValue(
	int condition
)
```
```fsharp
member GetConditionLowerValue :
        condition : int -> float
```

#### Parameters

condition Int32
     The condition index.

#### Return Value

Double The condition lower value.

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | The index condition is not larger or equal to 0 and less than ConditionCount. |

A value of -1 indicates an unrestricted value.

#### Reference

FabricationServiceButton Class

Autodesk.Revit.DB Namespace